Revit 2024 API
DisplacementElement.CanElementsBeAddedToDisplacementSet Method
 Indicates if these elements can be displaced by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId> toDisplace
)
Visual Basic
Public Function CanElementsBeAddedToDisplacementSet ( _
	toDisplace As ICollection(Of ElementId) _
) As Boolean
Visual C++
public:
bool CanElementsBeAddedToDisplacementSet(
	ICollection<ElementId^>^ toDisplace
)
Parameters
toDisplace
Type: System.Collections.Generic.ICollection<ElementId>
 The elements to displace.
Return Value
 True if the elements can be displaced by this DisplacementElement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace